
questMainMemo = {
"\t\tПрибытие\n\nотправиться к секретарю\n\nТы очнулся на дамбе Гувера, но ничего не помнишь. Человек по имени Джон Початок рассказал о том, что спас тебя, когда ты уже почти стал обедом для зомби. Он же посоветовал тебе отправиться к секретарю мэра и поговорить с ней ",
"\tПоиски Алекса\n\nнайти Алекса Мескини\n\nЭми МакДональд, секретарь мэра, дала тебе задание. Необходимо где-то найти Алекса Мескини и забрать у него ключ, после чего вернуть этот ключ Эми.\n\nПодсказка: Стоит спросить у местных жителей, где находится Алекс. Начнис Кетти Перри, которая находится в центральном здании",
"\tВажная информация\n\nПередать информацию об Алексе в Эль Кебрадос\n\nЧто-ж, Алекс развлекается в Новом Вегасе, а ты здесь, выполняешь курьерские задания, тебе не кажеться, что ты должен быть на его месте? Тем не менее, тебе необходимо добраться до зоны безопасности в Эль Кебрадосе, и там передать эту информацию парню костюме шерифа.\n\nПодсказка: На карте Пипбоя указаны все поселения",
"\tПафосные зомби\n\nПроверить завал в туннеле между Эль Кебрадосом и Сан Фиерро\n\nОчередное задание вроде съезди - и проверь, не надоело еще быть пешкой? Отправляйся в этот темный, склизкий туннель и проверь, все ли там нормально с завалом.",
"\tДрузья\n\nВстретиться с человеком у заправки\n\nЭто уже интереснее, кто-же там ждет встречи с тобой? Возможно, этот кто-то твой друг, из прошлой жизни, когда ты еще не попал на этот богом забытый остров, а может и нет. Но нет ничего хуже, чем ждать и догонять, так что быстрее отправляйся на встречу, мне даже самому интересно кто это.",
"\tПьяная черепаха?!\n\nОтправиться к Эми Макдональд\n\nВот это да, сам Сэм Смит почтил тебя своим вниманием, да и вернулся ты живым! Не каждому выпадает такая честь. Ну что-ж, отправляйся в Новую Деревню, передай там информацию Эми и вперед, на поиски преключений! Хотя... Тебе не кажется, что тебя опять просто используют?...",
"\tБлюз старого мира\n\nВстретиться с Моряком Попаем в Союзе Ученых\n\nНу, у меня просто слов нет. А у тебя? Коли-уж ты согласился на эту миссию, отправляемся в Союз Ученых, встречаться с Моряком Попаем. Помни - сила в шпинате. \n\nПодсказка: Если у вас еще нет пропуска в Союз Ученых, то его можно купить в Эль Кебрадосе у Медика.",
"\tРемонт спутников\n\nВосстановить свзяь со спутником\n\nКатерина Минет, неплохо звучит. Пошли, посмотрим, что она нам скажет сделать.",
"\tИндиана Джонс\n\nНайти 10 бункеров\n\nНу что сказать? Ищи.",
"\tВижу землю!\n\nПоговорить с гражданским комендантом\n\nНу наконец-то начинается ве1101000110000001110100001011010111010000101110111101000110001100110100001011010100101110001000001101000010011010110100011000000111010001100000101101000010110000110100011000001011010000101110000010110000100000110100011000111100100000110100001011011111010000101100001101000010110001",
"\tОпаньки\n\nПоговорить с Попаем\n\nВ пылу веселья, мы с тобой чуть не забыли про него. Пошли, расскажем ему, что у нас есть доступ к системе, которая поможет уничтожить Новый Вегас.",
"\Новые преключения!\n\nОтправиться на подводную лодку.\n\nНу все же он нас с тобой вообще ни во что не ставит, предлагает жалкие 2000 за то, чтоб мы сгоняли до подлодки, что-то там отключили и вернулись назад. Но ты согласился, ладно, едем, я всего-лишь журнал заданий, и я не могу принимать решения за нас.",
}

memoMainUpdates = {
	{""},
	{"", "\n\n* Возвращайся к секретарю мэра, Алекс благополучно свалил отсюда"},
	{""},
	{"", "\n\n* Проверь вторую часть туннеля", "", "\n\n* Пфф, похоже тут все в порядке, быть может тебя специально отправили в туннель?" },
	{""},
	{"", "", "\n\n* Надо убить 50 гулей по просьбе Эми Макдональд."},
	{"", "\n\n* Поговори с Гражданским Комендантом, который находится в Лабораториях." },
	{"", "\n\n* Отправляйся в Лас Вентурас на склад и подбери там грузовик.", "\n\n* Поговори с Катериной Минет.", "\n\n* Отправляйся в Лас Вентурас в церковь и подбери там кое-что.", "\n\n* Поговори с Катериной Минет", "\n\n* Поговори с Гражданским Комендантом" },
	{ "" },
	{ "" },
	{ "", "\n\n* Нет, ну каков-же гад. Сначала похитил нас, теперь делает деловое предложение. Поехали, поговорим с ним по-душам. У тебя на карте отмечено куда ехать, если нету пропуска, то купи у бандита в этом помещении." },
	{ "", "\n\n* Что? Где мы? Что там с подлодкой?" },
	{ "" },
	
}



questMemo = {
"Дивный старый мир\n\nУзнать, что случилось с миром\n\nЧто же случилось с миром? В Новой Деревне говорят, что это рак на горе свистнул, но мы же с тобой понимаем что это не так? Луис Суарес дал тебе совет поспрашивать о мэре Джонсе, докторе Д и глобальном потеплении в Союзе Ученых и Новом Вегасе.",
"Чудак из Вегаса\n\nВстретиться с Чудаком у большого камня в полдень\n\nНе слишком приятную встречу мы с тобой пережели, не так ли? Хотя, тебе же наверно интересно, что от тебя хочет этот чудак и про какие побрякушки он говорил? Осталось лишь одно узнать, где находится этот большой кааамень. Может, в местном баре что-то знают?",
"Спецдоставка\n\nВзять наркоту из детективного офиса в Эль Кебрадосе\n\nЯ думаю ты легко справишся. Мы с тобой отправляемся в Эль Кебрадос, там находим детективное агенство, врываемся в него, попутно отстреливаясь от зомби и, возможно даже, тиранов, находим две пачки наркоты, возвращаемся к Бобу Дилану, получаем бабло. Звучит просто, не так-ли?",
"Торговый Пост\n\nНайти Бобби Чарльтона и поселение Караванщиков\n\nБармен из бара Мегатонна попросил найти Бобби Чарльтона и поселение Караванщиков. Оно находится где-то в пригороде Лас Вентураса.",
"Тачка на прокачку\n\nНайти автомобиль 3 лопаты и привезти их Иксзибиту в Вест Сайд\n\nИксзибит из Вест Сайда попросил выполнить для него пару заданий. Первое - найти 3 лопаты и привезти ему .",
"Выходец из убежища\n\nНайти деталь J2 для GECK\n\nМеханик из Ривет Сити ищет деталь J2 для системы отопления на авианосце Ривет Сити. Он сказал, что на Торговом Посту Караванщиков должна быть такая в продаже.",
"Небольшая проблема\n\nУбить бандитов в кафе\n\nСтранный Боб Райт из Кламата попросил выполнить одно задание для него. Необходимо убить бандитов в пиццерии деревне Монтгомери.",
"Старым надо помогать\n\nВыполнить задания Роберта Мэйфлауэра\n\n* Надо разобрать старые очки Роберта на станке",
"Неделя\n\nТы встретил странное письмо гуля Аргаила. Давай съездим в Союз Ученых и сами посмотрим что там!",
"Поиски друга\n\nГерберт Дешвуд попросил найти его друга, гуля Аргаила. Он сказал, что гуль может быть на старой военной базе",
"Левый бизнес\n\nВиски-Боб из Кламата пообещал тебе хорошую плату, если ты заправишь дровами его самогонный аппарат",
"Перезагрузка\n\nМэр Роадтауна попросил тебя включить трансмиттеры. Их положение отмечено на карте Пипбоя.",

}

memoUpdates = {
	{""},
	{"", "\n\n* Необходимо уничтожить банду в ангаре старого аэропорта", "\n\n* Возвращаемся к Чудаку","/n Задание выполнено."},
	{"", "\n\n* Необходимо найти еще пачку наркоты", "\n\n* Необходимо найти еще пачку наркоты", "\nОбновление 2: Возвращаемся к Бобу Дилану", "", ""},
	{"", "\n\n* Бобби Чарльтон находится дальше в этом здании", "\nОбновление 2: Возвращаемся в бар Мегатонна","\nЗадание выполнено." },
	{"", "", "\n\n* Теперь ему нужно 20 банок шпината", "\n\n* Квест выполнен" },
	{"", "\n* Теперь к Марти Роббинсу", "\n* Едем в казино Сфинкс в Лас Вентурасе", "\n* Направляемся в Новый Вегас, к Джонни Кэшу", "\n* Куда еще надо будет?! Едем в туннель Форта Карсона, за зубной щеткой","\n* Зачем ему вообще чистая зубная щетка?! Поехали обратно.", "\n* Гайка у нас, возвращаемся к механику", "\n* Пздц - все, что я могу сказать"},
	{"", "", "\n\n* Возвращаемся к Бобу", "\n\n* Надо собрать устриц в соседней деревне", "\n\n* Едем обратно", "Задание выполнено", "" },
	{"", "", "\n\n* Надо взять новые стеклышки у Джона Початка", "", "\n\n* Надо собрать новые очки на станке (рецепт: стеклышки+оправа)", "", "" },
	{"", "\n\n* ЧТО! ЧТО ЭТО БЫЛО?!", "\n* БЫСТРЕЕ ОТПРАВЛЯЙСЯ В МЕГАТОННУ К ЭТОМУ СТРАННИКУ", "\n* Надо собрать этот супершпинат и показать той страшиле где раки зимуют", "\n* У нас запланирована стрелка с Самарой в Союзе Ученых", "\n\n* Well done!" },
	{"", "\n\n* Возвращаемся к Герберту","\n\n*Возможно, стоит съездить в Союз Ученых",""},
	{"", "", "\n\n* Возвращаемся к Виски-Бобу","\n\n* Ну, едем в Роадтаун","\n\n* Опять в Кламат",""},
	{"\n\nК номеру 1", "\n*к номеру 2", "\n*к номеру 3","\n*к номеру 4","\n*к номеру 5","\n*к номеру 6","\n*к номеру 7","\n*возвращаемся в Роадтаун","","\n* Нам надо найти логово мутантов рядом с надписью VINEWOOD. В качестве доказательства расправы надо отнести руку мутанта Баттерсу.", "\n\nВсе готово, теперь мы лююбимые наемники Роадтауна"},
}


questRows = {}

questsData = {
	{"Прибытие", "Новая Деревня", "Сюжетный",1},
	{"Поиски Алекса", "Новая Деревня", "Сюжетный",2},
	{"Важная информация", "Эль Кебрадос", "Сюжетный",3},
	{"Пафосные зомби", "Туннель", "Сюжетный",4},
	{"Друзья", "Эль Кебрадос", "Сюжетный",5},
	{"Пьяная черепаха?!", "Новая Деревня", "Сюжетный",6},
	{"Блюз старого мира", "Союз Ученых", "Сюжетный",7},
	{"Ремонт спутников", "Лас Вентурас", "Сюжетный",8},
	{"Индиана Джонс", "Вся пустыня", "Сюжетный",9},
	{"Вижу землю!", "Союз Ученых", "Сюжетный",10},
	{"Опаньки", "Союз Ученых", "Сюжетный",11},
	{"Новые преключения!", "Где-то там", "Сюжетный",11},
}

questsData2 = {
	{"Дивный старый мир", "Везде", "Побочный",1,6},
	{"Чудак из Вегаса", "Новый Вегас", "Побочный",2,4},
	{"Спецдоставка", "Эль Кебрадос", "Побочный",3,6},
	{"Торговый Пост", "Лас Вентурас", "Побочный",4,4},
	{"Тачка на прокачку", "Сан Фиерро", "Побочный",5,4},
	{"Выходец из убежища", "Ривет Сити", "Побочный", 6, 8 },
	{"Небольшая проблема", "Кламат", "Побочный", 7, 7 },
	{"Старым надо помогать", "Новая Деревня", "Побочный", 8, 7 },
	{"Неделя", "Союз Ученых", "Побочный", 9, 6 },
	{"Поиски друга", "Новый Вегас", "Побочный", 10, 3 },
	{"Левый бизнес", "Кламат", "Побочный", 11, 6 },
	{"Перезагрузка", "Роадтаун", "Побочный", 12, 11 },
}

questNames = {
	"world_quest",
	"quest_nvinsane",
	"detective_quest",
	"quest_findtp",
	"quest_vehicle",
	"quest_meh",
	"quest_prob",
	"quest_robert",
	"quest_ring",
	"quest_her", 
	"quest_whiskey",
	"quest_check",
}

nc_tasks = {
	{ 7, "антирад" },
	{ 11, "виски" },
	{ 17, "шпинат" },
	{ 20, "пакетик с орехами" },
	{ 1, "стимулятор" },
	{ 2, "шашлык из белки" },
}

nc_ranks = {
	"Искатель",
	"Ополченец",
	"Скаут",
	"Солдат",
	"Рейнджер",
	"Шериф",
}

nc_peds = {
	{ "рабочего, для возведения новых укреплений", "он" },
	{ "одного ветеринара, ", "он" },
	{ "механика, для починки механизма ворот", "он" },
}



function createQuestPanel ()
	questLabel = guiCreateLabel(xPip+430, yPip+70, 166, 370, "Выберите задание.\n\nЕсли вы не знаете куда идти для выполнения задания, дважды кликните по названию задания в списке слева, после этого на вашем компасе появится прозрачный треугольник, который будет указывать направление к цели. Один треугольник относится к цели сюжетного задания, один к цели побочного задания.", false)
	guiSetFont(questLabel, "default-bold-small")
	guiLabelSetHorizontalAlign(questLabel, "left", true)
	questPanel_Grid = guiCreateGridList(xPip+280, yPip+70, 133, 370, false)
	guiGridListAddColumn(questPanel_Grid, "Квест", 0.8)
	guiSetFont(questPanel_Grid, "default-small")
	guiSetAlpha(questPanel_Grid, 0.68)
	local mainQuest = getElementData ( localPlayer, "quest_main_st" )
	local i = 1 
	while i <= mainQuest do
		local row = guiGridListAddRow ( questPanel_Grid )
		guiGridListSetItemText ( questPanel_Grid, row, 1, questsData[i][1], false, false )
		if i < mainQuest then
			guiGridListSetItemColor(questPanel_Grid,row,1,102,102,102,255)
		end
		guiGridListSetItemData ( questPanel_Grid, row, 1, { i,1 } )
		i=i+1
	end
	if getElementData ( localPlayer, "quest_militia" ) > 0 then
		local rowID =  guiGridListAddRow ( questPanel_Grid )
		guiGridListSetItemText ( questPanel_Grid, rowID, 1, "Ополченец", false, false )
		guiGridListSetItemData ( questPanel_Grid, rowID, 1, { false, 3 } )
	end
	for i,quest in ipairs(questNames) do
		if getElementData ( localPlayer, quest ) > 0 then
			local rowID =  guiGridListAddRow ( questPanel_Grid )
			guiGridListSetItemText ( questPanel_Grid, rowID, 1, questsData2[i][1], false, false )
			if getElementData ( localPlayer, quest ) >= questsData2[i][5] then
				guiGridListSetItemColor(questPanel_Grid,rowID,1,102,102,102,255)
			end
			guiGridListSetItemData ( questPanel_Grid, rowID, 1, { questsData2[i][4], 2, getElementData ( localPlayer, quest ) } )
		end
	end
	addEventHandler ( "onClientGUIClick", questPanel_Grid, changeQuestMemo, false )
	addEventHandler ( "onClientGUIDoubleClick", questPanel_Grid, changeActiveTask, false )
end

function changeQuestMemo ( button )
	local selectedQuest = guiGridListGetSelectedItems ( questPanel_Grid )
	if selectedQuest[1] then
		local tmpData = guiGridListGetItemData ( questPanel_Grid, selectedQuest[1].row, 1)
		if tmpData[2] == 1 then 
			local mainQuestTemp = getElementData ( localPlayer, "quest_main" )
			local stageTemp = getElementData ( localPlayer, "quest_main_st" )
			finalString = "Ошибка PIPBOY OS 7. Перезапустите ваш PIPBOY-2000."
			if tmpData[1] < stageTemp then
				finalString = questMainMemo[tmpData[1]]
				for i = 1, #memoMainUpdates[tmpData[1]] do
					finalString = finalString .. memoMainUpdates[tmpData[1]][i]
				end
			else
				finalString = questMainMemo[stageTemp]
				for i = 1, mainQuestTemp do
					finalString = finalString .. memoMainUpdates[stageTemp][i]
				end
			end
		elseif tmpData[2] == 2 then
			finalString = questMemo[tmpData[1]]
			local quest_temp = tmpData[3]
			for i = 1, quest_temp do
				finalString = finalString .. memoUpdates[tmpData[1]][i]
			end
		elseif tmpData[2] == 3 then
			local nextRankString = ""
			if getElementData ( localPlayer, "ncRank" ) < 6 then
				nextRankString = "\nДо следующего ранга осталось: "..tostring(getElementData ( localPlayer, "ncRank" )*3-getElementData ( localPlayer, "ncTasksDone" ))
			end
			finalString = "Необходимо выполнять задания ополчения Новой Деревни.\n\nВаш текущий ранг: "..nc_ranks[getElementData ( localPlayer, "ncRank" )].."\nВыполнено заданий: "..tostring(getElementData ( localPlayer, "ncTasksDone" ))..nextRankString
			if getElementData ( localPlayer, "ncType" ) == 0 then
				finalString = finalString.."\n\nВ данный момент у вас нет активного задания. Запросите новое у Букера ДеВитта."
			else
				finalString = finalString.."\n\n\nТекущее задание\n\nНеобходимо "
				if getElementData ( localPlayer, "ncType" ) == 1 then
					local itemAmount = exports.inventory:getItemAmount ( getElementData ( localPlayer, "ncTarg" ) )
					local itemAmountString = "\nУ вас в инвентаре нет этой вещи."
					if itemAmount then
						itemAmountString = "\nКол-во у вас в инвентаре: "..tostring(itemAmount)
					end
					finalString = finalString.."принести ДеВитту "..nc_tasks[getElementData(localPlayer, "ncAddit" )][2]..".\n\nНеобходимое количество: "..tostring(getElementData(localPlayer, "ncAmount"))..itemAmountString
				elseif getElementData ( localPlayer, "ncType" ) == 2 then
					local zombAmount = getElementData ( localPlayer, "ncTarg" )
					if zombAmount > 0 then
						finalString = finalString.."убить гулей в окресностях дамбы. Осталось убить: "..tostring(zombAmount).."\n\nНаграда: "..tostring(getElementData(localPlayer, "ncAmount")).." крышек."
					else
						finalString = finalString.."убить гулей в окресностях дамбы. Задание выполнено, возвращайтесь к Букеру ДеВитту.\n\nНаграда: "..tostring(getElementData(localPlayer, "ncAmount")).." крышек."
					end
				elseif getElementData ( localPlayer, "ncType" ) == 3 then
					finalString = finalString.."сопроводить жителя Новой Деревни в Эль Кебрадос. Если житель отстанет от вас, он будет ждать вас в здании ополчения Новой Деревни."
				elseif getElementData ( localPlayer, "ncType" ) == 4 then
					finalString = finalString.."сопроводить жителя Новой Деревни в Эль Кебрадос. Задание выполнено, возвращайтесь к Букеру ДеВитту."
				end
			end
		end
		guiSetText ( questLabel, finalString )
	end
end

function changeActiveTask ( button )
	local selectedQuest = guiGridListGetSelectedItems ( questPanel_Grid )
	if selectedQuest[1] then
		local tmpData = guiGridListGetItemData ( questPanel_Grid, selectedQuest[1].row, 1)
		if tmpData[2] == 1 then 
			--exports.quests:updateCompassMainMarker ()
		elseif tmpData[2] == 2 then
			exports.quests:updateCompassAdditMarker (tmpData[1],tmpData[3])
		end
		guiSetText ( questLabel, finalString )
	end
end

function destroyQuestPanel ()
	removeEventHandler ( "onClientGUIClick", questPanel_Grid, changeQuestMemo )
	destroyElement ( questLabel )
	destroyElement ( questPanel_Grid )
end